examples/example.tex
% Created 2019-08-24 Sat 17:22
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Dario Klingenberg}
\date{\today}
\title{Example for a \LaTeX{} document}
\hypersetup{
 pdfauthor={Dario Klingenberg},
 pdftitle={Example for a \LaTeX{} document},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.2.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Introduction}
\label{sec:org99f5674}
  This document is intended to give an overview of what this library is useful for.
Since the goal I am trying to accomplish might be difficult to understand (the actual 
path to the goal is surprisingly simple),
I will start by explaining what led me to write this. 
If you write (complicated) \LaTeX{} and like lisp, this might be useful for you, or 
at least provide some food for thought.
\subsection{Motivation}
\label{sec:orgfa4a57e}
\LaTeX{}, like all modern markup languages I am aware of, has the huge advantage over
WYSIWYG editors that it separates content from representation. 
To start a new chapter in \LaTeX{}, it is natural to write \chapter{chapter-name},
instead of something like \textbf{chapter-name}. Even though your \LaTeX{} style 
may end up setting chapter headings in bold, most users are aware that
it would be terrible style hard-code that into your document source. 

On the other hand, when writing math formulas, it is not uncommon to see something like
\begin{equation}
\frac{d^2 y}{dx^2} = 0.
\end{equation}
(I'll admit that I used to also be guilty of writing \LaTeX{} like this)
What we want to represent here is the second derivative of y with respect to x - 
not a fraction with some weird expressions in the enumerator and the denominator.
It just so happens that derivatives are often written like this.
So, what we really should be doing is to create a \LaTeX{} macro, called e.g.
\derivative, that would allow us to write
\begin{equation}
\derivative[2]{y}{x} = 0
\end{equation}
and obtain the same as above. This has at least three big advantages:
\begin{itemize}
\item it is easier to write (no need for snippets)
\item it is easier to read
\item if we decide to change the notation (e.g. to y\textsuperscript{\(\prime\) \(\prime\)}), we only have to change the \LaTeX{} macro, not our \LaTeX{} source.
\end{itemize}
I actually created a large number of such \LaTeX{} macros to abstract my formulas - you can find them 
in my github. 
It turns out that even in this seemingly simple example, the 
macro does require some programming. For instance, if we have a first order derivative,
we do not want it to expand to
\frac{d^1 y}{dx^1}, but to omit the ones in the exponents. Also, if we mostly deal with first 
derivatives, we would like the number denoting the order of the derivative to 
be an optional argument. 
Personally, I found that even in this simple case, \LaTeX{} is not a lot of fun 
to program in. As the macros I wanted to create became more and more complex, 
the quality of my \LaTeX{} code quickly deteriorated. In some instances, I just copy/pasted 
code from stackoverflow. As a side effect, I often ended up not abstracting my formulas at
all.

When learing about lisp, I had the sudden realization that \LaTeX{} code is just 
a long string that can be generated by any programming language in the world (code=data and 
all that). Of course, I wanted to use lisp to accomplish this.
After doing some research, I decided that none of the existing solutions 
quite matched what I was trying to do, I decided to implement this library.

\section{Low level lisp functions}
\label{sec:org23f9798}
\begin{itemize}
\item tex-cmd
\item tex-env
\end{itemize}

\section{Writing my own parser}
\label{sec:org7090b90}
\begin{itemize}
\item tex-eval-lisp
\end{itemize}

\section{Possible workflows}
\label{sec:orga429763}
\subsection{Write everything in lisp}
\label{sec:orgcb78035}
\subsection{Input lisp-generated files into a main document}
\label{sec:org7400d8b}
\subsection{Use Emacs Org-mode (recommended)}
\label{sec:org58261b6}
I completely rely on org-mode's export capabilites. This lisp library only 
comes into play when I have to generate (complicated) \LaTeX{} code, especially 
longer formulas. Rather than write it ourselves or deal with \LaTeX{} macros,
we can just use lisp (or any other language we like) to generate the \LaTeX{} code 
for us. The question that of course remains is how to integrate that into our workflow. 
While there are probably many other ways (in particular, we could 
just generate the entire document using lisp), I find that org-mode makes it most 
simple - see the next section :)

\section{A section with formulas}
\label{sec:org83d4ae2}
This section is very interesting, because it contains lisp-generated \LaTeX{} code!
\begin{verbatim}

\begin{align}
\label{eq-simple} 
 1 + 1 &= 2 \\
\label{eq-differential} 
 \frac{d^{2 } y}{d x^{2 }} + y &= 0 
,
\end{align}
\end{verbatim}


Labels are optional, but when given, we can easliy refer to equation ref:eq-differential.
\end{document}
